{
    "displayName": "All Removable Media Devices",
    "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata",
    "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata",
        "groupSettingCollectionValue": [
            {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                "children": [
                    {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata_id",
                        "simpleSettingValue": {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                            "value": "{b7e99129-3e3c-44aa-b71e-f95e3f65336f}"
                        }
                    },
                    {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                        "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata_descriptoridlist",
                        "groupSettingCollectionValue": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingValue",
                                "children": [
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata_descriptoridlist_name",
                                        "simpleSettingValue": {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                            "value": "Windows Device Family(RemovableMediaDevices)"
                                        }
                                    },
                                    {
                                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                        "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata_descriptoridlist_primaryid",
                                        "simpleSettingValue": {
                                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                            "value": "RemovableMediaDevices"
                                        }
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata_matchtype",
                        "choiceSettingValue": {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                            "value": "device_vendor_msft_defender_configuration_devicecontrol_policygroups_{groupid}_groupdata_matchtype_matchany"
                        }
                    }
                ]
            }
        ]
    }
}